#+TITLE: July 4-15, 2019 (12 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 12
  :SPRINTSTART: <2019-07-04 Thu>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-RJ722: 2
  :wpd-sandeepk: 2
  :END:
** akshay196
*** DONE Learning GNU Emacs - Part II
    CLOSED: [2019-07-10 Wed 08:05]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   4.75
    :OWNER:    akshay196
    :ID:       READ.1560794346
    :TASKID:   READ.1560794346
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-10 Wed 07:03]--[2019-07-10 Wed 08:05] =>  1:02
    CLOCK: [2019-07-09 Tue 07:16]--[2019-07-09 Tue 07:56] =>  0:40
    CLOCK: [2019-07-08 Mon 07:02]--[2019-07-08 Mon 08:00] =>  0:58
    CLOCK: [2019-07-07 Sun 22:19]--[2019-07-07 Sun 23:13] =>  0:54
    CLOCK: [2019-07-05 Fri 07:11]--[2019-07-05 Fri 08:22] =>  1:11
    :END:
    - [X] Chapter 11. Emacs Lisp Programming                         ( 2h)
    - [X] Chapter 12. Version Control                                ( 1h)
    - [X] Chapter 13. Platform-specific considerations               ( 1h)
    - [X] Chapter 14. The Help System                                ( 1h)
*** DONE GNU Emacs bug triaging
    CLOSED: [2019-07-14 Sun 21:12]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   2.98
    :OWNER: akshay196
    :ID: OPS.1562238634
    :TASKID: OPS.1562238634
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-14 Sun 20:54]--[2019-07-14 Sun 21:11] =>  0:17
    CLOCK: [2019-07-14 Sun 18:47]--[2019-07-14 Sun 19:52] =>  1:05
    CLOCK: [2019-07-12 Fri 07:01]--[2019-07-12 Fri 08:03] =>  1:02
    CLOCK: [2019-07-11 Thu 06:59]--[2019-07-11 Thu 07:34] =>  0:35
    :END:
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=36490][#36490]]: directory-files-recursively breaks when it encounters a directory named "~"
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35340][#35340]]: ffap: dired wildcards always needs a wildcard in the filename
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35166][#35166]]: Buffer state inconsistent after vc-retrieve-tag
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=32753][#32753]]: Bogus icomplete behavior
*** DONE Read [[https://www.laurentluce.com/posts/python-dictionary-implementation/][Python dictionary implementation]]
    CLOSED: [2019-07-14 Sun 22:56]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   1.18
    :OWNER: akshay196
    :ID: READ.1562241440
    :TASKID: READ.1562241440
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-14 Sun 21:44]--[2019-07-14 Sun 22:55] =>  1:11
    :END:
*** DONE Read [[https://treyhunner.com/2018/06/how-to-make-an-iterator-in-python/][How to make an iterator in Python]]
    CLOSED: [2019-07-15 Mon 08:20]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:   0.97
    :OWNER: akshay196
    :ID: READ.1562241993
    :TASKID: READ.1562241993
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-15 Mon 07:22]--[2019-07-15 Mon 08:20] =>  0:58
    :END:
** bhavin192
*** DONE Namespaces in operation series [8/8]
    CLOSED: [2019-07-14 Sun 16:47]
    :PROPERTIES:
    :ESTIMATED: 3.5
    :ACTUAL:   5.50
    :OWNER:    bhavin192
    :ID:       READ.1560960967
    :TASKID:   READ.1560960967
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-14 Sun 16:14]--[2019-07-14 Sun 16:47] =>  0:33
    CLOCK: [2019-07-14 Sun 15:21]--[2019-07-14 Sun 16:01] =>  0:40
    CLOCK: [2019-07-11 Thu 19:10]--[2019-07-11 Thu 19:59] =>  0:49
    CLOCK: [2019-07-10 Wed 22:04]--[2019-07-10 Wed 22:28] =>  0:24
    CLOCK: [2019-07-10 Wed 21:46]--[2019-07-10 Wed 21:55] =>  0:09
    CLOCK: [2019-07-10 Wed 19:23]--[2019-07-10 Wed 20:13] =>  0:50
    CLOCK: [2019-07-09 Tue 19:23]--[2019-07-09 Tue 20:14] =>  0:51
    CLOCK: [2019-07-08 Mon 21:35]--[2019-07-08 Mon 22:49] =>  1:14
    :END:
    https://lwn.net/Articles/531114/#series_index
    - [X] [[https://lwn.net/Articles/531381/][2: the namespaces API]]                                       (25m)
    - [X] [[https://lwn.net/Articles/531419/][3: PID namespaces]]                                           (20m)
    - [X] [[https://lwn.net/Articles/532748/][4: more on PID namespaces]]                                   (35m)
    - [X] [[https://lwn.net/Articles/532593/][5: User namespaces]]                                          (30m)
    - [X] [[https://lwn.net/Articles/540087/][6: more on user namespaces]]                                  (25m)
    - [X] [[https://lwn.net/Articles/580893/][7: Network namespaces]]                                       (15m)
    - [X] [[https://lwn.net/Articles/689856/][Mount namespaces and shared subtrees]]                        (30m)
    - [X] [[https://lwn.net/Articles/690679/][Mount namespaces, mount propagation, and unbindable mounts]]  (20m)
*** DONE Mastering Distributed Tracing - I. Introduction [3/3]
    CLOSED: [2019-07-15 Mon 21:57]
    :PROPERTIES:
    :ESTIMATED: 2.5
    :ACTUAL:   2.78
    :OWNER:    bhavin192
    :ID:       READ.1562555265
    :TASKID:   READ.1562555265
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-15 Mon 21:20]--[2019-07-15 Mon 21:57] =>  0:37
    CLOCK: [2019-07-15 Mon 19:02]--[2019-07-15 Mon 19:57] =>  0:55
    CLOCK: [2019-07-14 Sun 19:21]--[2019-07-14 Sun 19:46] =>  0:25
    CLOCK: [2019-07-14 Sun 17:53]--[2019-07-14 Sun 18:43] =>  0:50
    :END:
    - [X] 1. Why Distributed Tracing?                          (42m)
    - [X] 2. Take Tracing for a HotROD Ride                    (68m)
    - [X] 3. Distributed Tracing Fundamentals                  (42m)
** gandalfdwite
*** DONE Unix Concepts & Applications by Sumitabha Das Part IV [3/3]
    CLOSED: [2019-07-15 Mon 22:48]
   :PROPERTIES:
   :ESTIMATED: 9
   :ACTUAL:   9.43
   :OWNER: gandalfdwite
   :ID: READ.1553532278
   :TASKID: READ.1553532278
   :END:
   :LOGBOOK:
   CLOCK: [2019-07-14 Sun 19:11]--[2019-07-14 Sun 20:25] =>  1:14
   CLOCK: [2019-07-13 Sat 10:12]--[2019-07-13 Sat 11:20] =>  1:08
   CLOCK: [2019-07-11 Thu 20:39]--[2019-07-11 Thu 21:40] =>  1:01
   CLOCK: [2019-07-10 Wed 22:05]--[2019-07-10 Wed 22:58] =>  0:53
   CLOCK: [2019-07-09 Tue 23:40]--[2019-07-10 Wed 00:20] =>  0:40
   CLOCK: [2019-07-08 Mon 21:10]--[2019-07-08 Mon 22:22] =>  1:12
   CLOCK: [2019-07-07 Sun 20:24]--[2019-07-07 Sun 21:35] =>  1:11
   CLOCK: [2019-07-06 Sat 09:15]--[2019-07-06 Sat 10:17] =>  1:02
   CLOCK: [2019-07-04 Thu 21:46]--[2019-07-04 Thu 22:51] =>  1:05
   :END:
   - [X] 13. Regular expressions                 ( 3h)
   - [X] 14. Essential shell programming         ( 3h)
   - [X] 15. Essential System Administration     ( 3h)
*** DONE Setup Blogging Website [1/1]
    CLOSED: [2019-07-15 Mon 22:48]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:   3.92
    :OWNER: gandalfdwite
    :ID: Do.1562171060
    :TASKID: Do.1562171060
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-15 Mon 19:13]--[2019-07-15 Mon 21:48] =>  2:35
    CLOCK: [2019-07-14 Sun 15:05]--[2019-07-14 Sun 16:25] =>  1:20
    :END:

    - [X] Finish setup and publish first blog post  ( 3h)
** RJ722
*** Write one blog post
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:
    :OWNER: RJ722
    :ID: WRITE.1562247371
    :TASKID: WRITE.1562247371
    :END:
*** Write one ~two~ blog posts - PART 2 [1/2]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER: RJ722
    :ID: WRITE.1560491297
    :TASKID: WRITE.1560491297
    :END:
    - [ ] Post 2
*** Participate in a Kaggle Competition - PART 1
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: RJ722
    :ID: DEV.1561010265
    :TASKID: DEV.1561010265
    :END:
*** Finish fastai part-1
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:
    :OWNER: RJ722
    :ID: TASK.1562243888
    :TASKID: TASK.1562243888
    :END:
** sandeepk
*** DONE Blog writing - Part II [2/2]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:   4.25
    :OWNER: sandeepk
    :ID: WRITE.1560792221
    :TASKID: WRITE.1560792221
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-15 Mon 16:40]--[2019-07-15 Mon 17:20] =>  0:40
    CLOCK: [2019-07-15 Mon 12:30]--[2019-07-15 Mon 13:30] =>  1:00
    CLOCK: [2019-07-10 Wed 21:20]--[2019-07-10 Wed 22:30] =>  1:10
    CLOCK: [2019-07-09 Tue 21:00]--[2019-07-09 Tue 21:45] =>  0:45
    CLOCK: [2019-07-07 Sun 21:20]--[2019-07-07 Sun 21:40] =>  0:20
    CLOCK: [2019-07-07 Sun 17:05]--[2019-07-07 Sun 17:25] =>  0:20
    :END:
    - [X] Blog about Google Cloud Platform VPC(Virtual Private Network)       (5h)
    - [X] Database Certificate genration and PyCharm linkage to Database      (3h)
*** DONE Project Stack NEWS - Part III [1/1]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   4.58
    :OWNER: sandeepk
    :ID: DEV.1552226887
    :TASKID: DEV.1552226887
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-10 Wed 23:40]--[2019-07-11 Thu 00:50] =>  1:10
    CLOCK: [2019-07-09 Tue 22:40]--[2019-07-10 Wed 00:55] =>  2:15
    CLOCK: [2019-07-08 Mon 21:40]--[2019-07-08 Mon 22:50] =>  1:10
    :END:
    - [X] Implement Comment logic          (5h)

